MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0E1053CNK/mcu.h
typedef struct                         /*!< (@ 0x400A1000) R_PORGA Structure                                          */
{
    union
    {
        __IOM uint8_t SNFEN;           /*!< (@ 0x00000000) SAU Noise Filter Enable Register                           */

        struct
        {
            __IOM uint8_t SNFEN00 : 1; /*!< [0..0] Use of Noise Filter of RxD0 Pin                                    */
            uint8_t               : 1;
            __IOM uint8_t SNFEN10 : 1; /*!< [2..2] Use of Noise Filter of RxD1 Pin                                    */
            uint8_t               : 1;
            __IOM uint8_t SNFEN20 : 1; /*!< [4..4] Use of Noise Filter of RxD2 Pin                                    */
            uint8_t               : 3;
        } SNFEN_b;
    };

    union
    {
        __IOM uint8_t TNFEN;           /*!< (@ 0x00000001) TAU Noise Filter Enable Register                           */

        struct
        {
            __IOM uint8_t TNFEN00 : 1; /*!< [0..0] Enabling or Disabling Use of the Noise Filter for the
                                        *   TI00 Pin                                                                  */
            __IOM uint8_t TNFEN01 : 1; /*!< [1..1] Enabling or Disabling Use of the Noise Filter for the
                                        *   TI01 Pin                                                                  */
            __IOM uint8_t TNFEN02 : 1; /*!< [2..2] Enabling or Disabling Use of the Noise Filter for the
                                        *   TI02 Pin                                                                  */
            __IOM uint8_t TNFEN03 : 1; /*!< [3..3] Enabling or Disabling Use of the Noise Filter for the
                                        *   TI03 Pin                                                                  */
            __IOM uint8_t TNFEN04 : 1; /*!< [4..4] Enabling or Disabling Use of the Noise Filter for the
                                        *   TI04 Pin                                                                  */
            __IOM uint8_t TNFEN05 : 1; /*!< [5..5] Enabling or Disabling Use of the Noise Filter for the
                                        *   TI05 Pin                                                                  */
            __IOM uint8_t TNFEN06 : 1; /*!< [6..6] Enabling or Disabling Use of the Noise Filter for the
                                        *   TI06 Pin                                                                  */
            __IOM uint8_t TNFEN07 : 1; /*!< [7..7] Enabling or Disabling Use of the Noise Filter for the
                                        *   TI07 Pin                                                                  */
        } TNFEN_b;
    };
    __IM uint8_t RESERVED;

    union
    {
        __IOM uint8_t ISC;             /*!< (@ 0x00000003) Input Switch Control Register                              */

        struct
        {
            __IOM uint8_t ISC0   : 1;  /*!< [0..0] Switching External Interrupt (IRQ0) Input                          */
            __IOM uint8_t ISC1   : 1;  /*!< [1..1] Switching Channel 7 Input of Timer Array Unit                      */
            __IOM uint8_t SSIE00 : 1;  /*!< [2..2] Setting of the SSI00 Input of Channel 0 in the Communications
                                        *   Through SPI00 in the Slave Mode                                           */
            uint8_t : 5;
        } ISC_b;
    };

    union
    {
        __IOM uint8_t TIS0;            /*!< (@ 0x00000004) Timer Input Select Register 0                              */

        struct
        {
            __IOM uint8_t TIS : 3;     /*!< [2..0] Selection of Timer Input Used with Channel 5                       */
            uint8_t           : 5;
        } TIS0_b;
    };

    union
    {
        __IOM uint8_t TIS1;            /*!< (@ 0x00000005) Timer Input Select Register 1                              */

        struct
        {
            __IOM uint8_t TIS0 : 1;    /*!< [0..0] Selection of Timer Input Used with Channel 0                       */
            __IOM uint8_t TIS1 : 1;    /*!< [1..1] Selection of Timer Input Used with Channel 1                       */
            uint8_t            : 6;
        } TIS1_b;
    };
    __IM uint8_t RESERVED1[3];

    union
    {
        __IOM uint8_t ULBS;            /*!< (@ 0x00000009) UART Loopback Select Register                              */

        struct
        {
            __IOM uint8_t ULBS0 : 1;   /*!< [0..0] Selection of the UART0 Loopback Function                           */
            __IOM uint8_t ULBS1 : 1;   /*!< [1..1] Selection of the UART1 Loopback Function                           */
            __IOM uint8_t ULBS2 : 1;   /*!< [2..2] Selection of the UART2 Loopback Function                           */
            uint8_t             : 1;
            __IOM uint8_t ULBS4 : 1;   /*!< [4..4] Selection of the UARTA0 Loopback Function                          */
            __IOM uint8_t ULBS5 : 1;   /*!< [5..5] Selection of the UARTA1 Loopback Function                          */
            uint8_t             : 2;
        } ULBS_b;
    };
    __IM uint8_t RESERVED2[6];

    union
    {
        __IOM uint8_t CCS[8];          /*!< (@ 0x00000010) Output Current Select Register [0..7]                      */

        struct
        {
            __IOM uint8_t SET : 3;     /*!< [2..0] Setting for the low-level output current                           */
            uint8_t           : 5;
        } CCS_b[8];
    };

    union
    {
        __IOM uint8_t CCDE;            /*!< (@ 0x00000018) Output Current Control Enable Register                     */

        struct
        {
            __IOM uint8_t EN0 : 1;     /*!< [0..0] Output Current Control Function Enable for CCD0 Pin                */
            __IOM uint8_t EN1 : 1;     /*!< [1..1] Output Current Control Function Enable for CCD1 Pin                */
            __IOM uint8_t EN2 : 1;     /*!< [2..2] Output Current Control Function Enable for CCD2 Pin                */
            __IOM uint8_t EN3 : 1;     /*!< [3..3] Output Current Control Function Enable for CCD3 Pin                */
            __IOM uint8_t EN4 : 1;     /*!< [4..4] Output Current Control Function Enable for CCD4 Pin                */
            __IOM uint8_t EN5 : 1;     /*!< [5..5] Output Current Control Function Enable for CCD5 Pin                */
            __IOM uint8_t EN6 : 1;     /*!< [6..6] Output Current Control Function Enable for CCD6 Pin                */
            __IOM uint8_t EN7 : 1;     /*!< [7..7] Output Current Control Function Enable for CCD7 Pin                */
        } CCDE_b;
    };
} R_PORGA_Type;                        /*!< Size = 25 (0x19)                                                          */

/* =========================================================================================================================== */
/* ================                                           R_PFS                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief I/O Ports-PFS (R_PFS)
 */

